IDENTIFICATION DIVISION.
PROGRAM-ID. ALBOL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.

FILE SECTION.
    FD ALBUM-LIST-FILE.
    01 ALBUM-RECORD.
        03 ALBUM-TITLE-RECORD PICTURE X(50).
        03 ALBUM-ARTIST-RECORD PICTURE X(50).
        03 ALBUM-RATING-RECORD PICTURE 9V99.
        03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9.99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 EDIT-MODE PICTURE X.
        88 EDIT-TITLE VALUE 'T'.
        88 EDIT-ARTIST VALUE 'A'.
        88 EDIT-RATING VALUE 'R'.

PROCEDURE DIVISION.
MAIN-BRANCH.
    DISPLAY "Albol version 0, Copyright (C) 2025 D. Hargitt"
    DISPLAY "Albol comes with ABSOLUTELY NO WARRANTY; for details"
    DISPLAY "view LICENSE.md. This is free software, and you are"
    DISPLAY "welcome to redistribute it under certain conditions."
    DISPLAY "===================================================="
    DISPLAY "WELCOME TO ALBOL."
    DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
    DISPLAY "ADD    ADD ALBUM RECORD."
    DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
    DISPLAY "EDIT   EDIT AN ALBUM RECORD."
    DISPLAY "EXIT   EXIT THE APPLICATION."
    DISPLAY "===================================================="

    PERFORM UNTIL 1 EQUAL 0
        ACCEPT CHOSEN-ACTION

        EVALUATE CHOSEN-ACTION
            WHEN "ADD"
                PERFORM ADD-BRANCH
            WHEN "VIEW"
                PERFORM VIEW-BRANCH
            WHEN "EDIT"
                PERFORM EDIT-BRANCH
            WHEN "EXIT"
                STOP RUN
            WHEN OTHER
                DISPLAY "FUNCTION NOT RECOGNIZED."
        END-EVALUATE

        DISPLAY "===================================================="
        DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
        DISPLAY "ADD    ADD ALBUM RECORD."
        DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
        DISPLAY "EDIT   EDIT AN ALBUM RECORD."
        DISPLAY "EXIT   EXIT THE APPLICATION."
        DISPLAY "===================================================="
    END-PERFORM

    STOP RUN.

ADD-BRANCH.
    DISPLAY "ADD ALBUM RECORD FUNCTION."
    DISPLAY "INPUT A TITLE."
    ACCEPT ALBUM-TITLE
    DISPLAY "INPUT AN ARTIST."
    ACCEPT ALBUM-ARTIST
    DISPLAY "INPUT A RATING."
    ACCEPT ALBUM-RATING

    INITIALIZE ALBUM-RECORD
    MOVE ALBUM-TITLE TO ALBUM-TITLE-RECORD
    MOVE ALBUM-ARTIST TO ALBUM-ARTIST-RECORD
    MOVE ALBUM-RATING TO ALBUM-RATING-RECORD
    MOVE X"0A" TO ALBUM-RECORD-NEWLINE

    OPEN EXTEND ALBUM-LIST-FILE
    WRITE ALBUM-RECORD

    IF FILE-STATUS-CODE EQUAL "48"
        DISPLAY "ERROR: FILE 'album-list.txt' DOES NOT EXIST."
        DISPLAY "PLEASE CREATE THE FILE."
    ELSE
        IF FILE-STATUS-CODE NOT EQUAL "00"
            DISPLAY "WRITE FAILED WITH STATUS: " FILE-STATUS-CODE
        END-IF
    END-IF

    CLOSE ALBUM-LIST-FILE.

VIEW-BRANCH.
    DISPLAY "INPUT A TITLE."

    ACCEPT ALBUM-TITLE

    OPEN INPUT ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    PERFORM UNTIL EOF-REACHED
        IF ALBUM-TITLE-RECORD EQUAL ALBUM-TITLE
            DISPLAY "FOUND RECORD."
            DISPLAY "ARTIST: " ALBUM-ARTIST-RECORD
            DISPLAY "RATING: " ALBUM-RATING-RECORD
            MOVE 'Y' TO EOF
        END-IF
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
    END-PERFORM
    CLOSE ALBUM-LIST-FILE.

EDIT-BRANCH.
    DISPLAY "INPUT A TITLE."
    ACCEPT ALBUM-TITLE

    OPEN I-O ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    PERFORM UNTIL EOF-REACHED
        IF ALBUM-TITLE-RECORD EQUAL ALBUM-TITLE
            DISPLAY "FOUND RECORD."
            DISPLAY "ARTIST: " ALBUM-ARTIST-RECORD
            DISPLAY "RATING: " ALBUM-RATING-RECORD

            DISPLAY "INPUT ELEMENT TO CHANGE."
            DISPLAY "TITLE/ARTIST/RATING."
            ACCEPT CHOSEN-ACTION
            MOVE CHOSEN-ACTION(1:1) TO EDIT-MODE

            SET EOF-REACHED TO TRUE
        END-IF
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
    END-PERFORM
    
    EVALUATE EDIT-MODE
        WHEN 'T'
            DISPLAY "INPUT NEW TITLE."
            ACCEPT ALBUM-TITLE
            MOVE ALBUM-TITLE TO ALBUM-TITLE-RECORD
        WHEN 'A'
            DISPLAY "INPUT NEW ARTIST."
            ACCEPT ALBUM-ARTIST
            MOVE ALBUM-ARTIST TO ALBUM-ARTIST-RECORD
        WHEN 'R'
            DISPLAY "INPUT NEW RATING."
            ACCEPT ALBUM-RATING
            MOVE ALBUM-RATING TO ALBUM-RATING-RECORD
        WHEN OTHER
            DISPLAY "INVALID CHOICE."
    END-EVALUATE
    
    REWRITE ALBUM-RECORD
    
    CLOSE ALBUM-LIST-FILE.
