IDENTIFICATION DIVISION.
PROGRAM-ID. ALBOL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9.99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 EDIT-MODE PICTURE X.
        88 EDIT-TITLE VALUE 'T'.
        88 EDIT-ARTIST VALUE 'A'.
        88 EDIT-RATING VALUE 'R'.
    01 TOTAL-RATING PICTURE 999V99.
    01 RATING-COUNT PICTURE 999.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.

PROCEDURE DIVISION.
MAIN-BRANCH.
    DISPLAY "===================================================="
    DISPLAY "Albol version 0, Copyright (C) 2025 D. Hargitt"
    DISPLAY "Albol comes with ABSOLUTELY NO WARRANTY; for details"
    DISPLAY "view LICENSE.md. This is free software, and you are"
    DISPLAY "welcome to redistribute it under certain conditions."
    DISPLAY "===================================================="
    DISPLAY "WELCOME TO ALBOL."
    DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
    DISPLAY "ADD    ADD ALBUM RECORD."
    DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
    DISPLAY "EDIT   EDIT AN ALBUM RECORD."
    DISPLAY "MORE   MORE OPTIONS."
    DISPLAY "EXIT   EXIT THE APPLICATION."
    DISPLAY "===================================================="

    PERFORM UNTIL 1 EQUAL 0
        ACCEPT CHOSEN-ACTION

        EVALUATE CHOSEN-ACTION
            WHEN "ADD"
                PERFORM ADD-BRANCH
            WHEN "VIEW"
                CALL "VIEW-BRANCH"
            WHEN "EDIT"
                PERFORM EDIT-BRANCH
            WHEN "MORE"
                PERFORM MORE-BRANCH
            WHEN "EXIT"
                STOP RUN
            WHEN OTHER
                DISPLAY "FUNCTION NOT RECOGNIZED."
        END-EVALUATE

        DISPLAY "===================================================="
        DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
        DISPLAY "ADD    ADD ALBUM RECORD."
        DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
        DISPLAY "EDIT   EDIT AN ALBUM RECORD."
        DISPLAY "MORE   MORE OPTIONS."
        DISPLAY "EXIT   EXIT THE APPLICATION."
        DISPLAY "===================================================="
    END-PERFORM

    STOP RUN.

ADD-BRANCH.
    DISPLAY "ADD ALBUM RECORD FUNCTION."
    DISPLAY "INPUT A TITLE."
    ACCEPT ALBUM-TITLE
    DISPLAY "INPUT AN ARTIST."
    ACCEPT ALBUM-ARTIST
    DISPLAY "INPUT A RATING."
    ACCEPT ALBUM-RATING

    INITIALIZE ALBUM-RECORD
    MOVE ALBUM-TITLE TO ALBUM-TITLE-RECORD
    MOVE ALBUM-ARTIST TO ALBUM-ARTIST-RECORD
    MOVE ALBUM-RATING TO ALBUM-RATING-RECORD
    MOVE X"0A" TO ALBUM-RECORD-NEWLINE

    OPEN EXTEND ALBUM-LIST-FILE

    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "ERROR: FILE 'album-list.txt' DOES NOT EXIST."
        DISPLAY "PLEASE CREATE THE FILE."
        CLOSE ALBUM-LIST-FILE
        EXIT PARAGRAPH
    ELSE
        IF FILE-STATUS-CODE NOT EQUAL "00"
            DISPLAY "WRITE FAILED WITH STATUS: " FILE-STATUS-CODE
            CLOSE ALBUM-LIST-FILE
            EXIT PARAGRAPH
        END-IF
    END-IF

    WRITE ALBUM-RECORD

    CLOSE ALBUM-LIST-FILE.

EDIT-BRANCH.
    DISPLAY "INPUT A TITLE."
    ACCEPT ALBUM-TITLE

    OPEN I-O ALBUM-LIST-FILE

    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "ERROR: FILE 'album-list.txt' DOES NOT EXIST."
        DISPLAY "PLEASE CREATE THE FILE."
        CLOSE ALBUM-LIST-FILE
        EXIT PARAGRAPH
    END-IF

    MOVE 'N' TO EOF

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(ALBUM-TITLE-RECORD) EQUAL 
                    FUNCTION LOWER-CASE(ALBUM-TITLE)
                DISPLAY "FOUND RECORD."
                DISPLAY "ARTIST: " FUNCTION TRIM(ALBUM-ARTIST-RECORD)
                DISPLAY "RATING: " FUNCTION TRIM(ALBUM-RATING-RECORD)

                DISPLAY "INPUT ELEMENT TO CHANGE."
                DISPLAY "TITLE/ARTIST/RATING."
                ACCEPT CHOSEN-ACTION
                MOVE CHOSEN-ACTION(1:1) TO EDIT-MODE

                MOVE 'Y' TO EOF
            END-IF
    END-PERFORM
    
    EVALUATE EDIT-MODE
        WHEN 'T'
            DISPLAY "INPUT NEW TITLE."
            ACCEPT ALBUM-TITLE
            MOVE ALBUM-TITLE TO ALBUM-TITLE-RECORD
        WHEN 'A'
            DISPLAY "INPUT NEW ARTIST."
            ACCEPT ALBUM-ARTIST
            MOVE ALBUM-ARTIST TO ALBUM-ARTIST-RECORD
        WHEN 'R'
            DISPLAY "INPUT NEW RATING."
            ACCEPT ALBUM-RATING
            MOVE ALBUM-RATING TO ALBUM-RATING-RECORD
        WHEN OTHER
            DISPLAY "INVALID CHOICE."
    END-EVALUATE
    
    REWRITE ALBUM-RECORD
    
    CLOSE ALBUM-LIST-FILE.

MORE-BRANCH.
    DISPLAY "CHOOSE FROM THE FOLLOWING EXTENDED OPTIONS."
    DISPLAY "EMPTY  REMOVE ALL RECORDS."
    DISPLAY "INIT   INITIALIZE STORAGE FILE."
    DISPLAY "CUT    REMOVE A RECORD."

    ACCEPT CHOSEN-ACTION

    EVALUATE CHOSEN-ACTION
        WHEN "EMPT"
            PERFORM EMPT-BRANCH
        WHEN "INIT"
            PERFORM INIT-BRANCH
        WHEN "CUT"
            PERFORM CUT-BRANCH
        WHEN OTHER
            DISPLAY "INVALID OPTION.".

INIT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE NOT EQUAL "35"
        DISPLAY "FILE ALREADY EXISTS."
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
    END-IF.

EMPT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "FILE DOES NOT EXIST."
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
    END-IF.

CUT-BRANCH.
    DISPLAY "INPUT TITLE."
    ACCEPT ALBUM-TITLE
    
    SET FOUND-RECORD-FALSE TO TRUE
    MOVE 'N' TO EOF

    OPEN I-O ALBUM-LIST-FILE
    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF ALBUM-TITLE-RECORD EQUAL ALBUM-TITLE
                MOVE 'Y' TO EOF
                SET FOUND-RECORD-TRUE TO TRUE
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        DISPLAY "RECORD NOT FOUND."
        CLOSE ALBUM-LIST-FILE
        EXIT PARAGRAPH
    END-IF

    DISPLAY "ARTIST IS " FUNCTION TRIM(ALBUM-ARTIST-RECORD) "."
    DISPLAY "IS THAT CORRECT (Y/N)?"
    ACCEPT CHOSEN-ACTION

    IF CHOSEN-ACTION EQUAL "Y"
        MOVE " " TO ALBUM-TITLE-RECORD
        MOVE " " TO ALBUM-ARTIST-RECORD
        MOVE 0 TO ALBUM-RATING-RECORD

        REWRITE ALBUM-RECORD
    ELSE
        DISPLAY "ABORTED."
    END-IF

    CLOSE ALBUM-LIST-FILE.
