>>SOURCE FORMAT FREE
*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. ALBOL.

DATA DIVISION.

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).

PROCEDURE DIVISION.
MAIN-BRANCH.
    PERFORM LINE-SPLIT
    DISPLAY "Albol version 0, Copyright (C) 2025 D. Hargitt"
    DISPLAY "Albol comes with ABSOLUTELY NO WARRANTY; for details"
    DISPLAY "view LICENSE.md. This is free software, and you are"
    DISPLAY "welcome to redistribute it under certain conditions."
    PERFORM LINE-SPLIT
    DISPLAY "WELCOME TO ALBOL."
    PERFORM LINE-SPLIT
    DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
    DISPLAY "ADD    ADD ALBUM RECORD."
    DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
    DISPLAY "EDIT   EDIT AN ALBUM RECORD."
    DISPLAY "TRACK  ACCESS INDIVIDUAL TRACK OPTIONS."
    DISPLAY "MORE   MORE OPTIONS."
    DISPLAY "EXIT   EXIT THE APPLICATION."
    PERFORM LINE-SPLIT

    PERFORM UNTIL 1 EQUAL 0
        ACCEPT CHOSEN-ACTION

        PERFORM LINE-SPLIT

        EVALUATE CHOSEN-ACTION
            WHEN "ADD"
                CALL "ADD-BRANCH"
            WHEN "VIEW"
                CALL "VIEW-BRANCH"
            WHEN "EDIT"
                CALL "EDIT-BRANCH"
            WHEN "MORE"
                CALL "MORE-BRANCH"
            WHEN "TRAC"
                CALL "TRAC-BRANCH"
            WHEN "EXIT"
                STOP RUN
            WHEN OTHER
                DISPLAY "FUNCTION NOT RECOGNIZED."
                PERFORM LINE-SPLIT
        END-EVALUATE

        DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
        DISPLAY "ADD    ADD ALBUM RECORD."
        DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
        DISPLAY "EDIT   EDIT AN ALBUM RECORD."
        DISPLAY "TRACK  ACCESS INDIVIDUAL TRACK OPTIONS."
        DISPLAY "MORE   MORE OPTIONS."
        DISPLAY "EXIT   EXIT THE APPLICATION."
        PERFORM LINE-SPLIT
    END-PERFORM

    STOP RUN.

LINE-SPLIT.
    DISPLAY "====================================================".
