*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. ALBOL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9.99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.

PROCEDURE DIVISION.
MAIN-BRANCH.
    PERFORM LINE-SPLIT
    DISPLAY "Albol version 0, Copyright (C) 2025 D. Hargitt"
    DISPLAY "Albol comes with ABSOLUTELY NO WARRANTY; for details"
    DISPLAY "view LICENSE.md. This is free software, and you are"
    DISPLAY "welcome to redistribute it under certain conditions."
    PERFORM LINE-SPLIT
    DISPLAY "WELCOME TO ALBOL."
    PERFORM LINE-SPLIT
    DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
    DISPLAY "ADD    ADD ALBUM RECORD."
    DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
    DISPLAY "EDIT   EDIT AN ALBUM RECORD."
    DISPLAY "MORE   MORE OPTIONS."
    DISPLAY "EXIT   EXIT THE APPLICATION."
    PERFORM LINE-SPLIT

    PERFORM UNTIL 1 EQUAL 0
        ACCEPT CHOSEN-ACTION

        PERFORM LINE-SPLIT

        EVALUATE CHOSEN-ACTION
            WHEN "ADD"
                CALL "ADD-BRANCH"
            WHEN "VIEW"
                CALL "VIEW-BRANCH"
            WHEN "EDIT"
                CALL "EDIT-BRANCH"
            WHEN "MORE"
                CALL "MORE-BRANCH"
            WHEN "EXIT"
                STOP RUN
            WHEN OTHER
                DISPLAY "FUNCTION NOT RECOGNIZED."
                PERFORM LINE-SPLIT
        END-EVALUATE

        DISPLAY "CHOOSE YOUR DESIRED FUNCTION FROM THE FOLLOWING."
        DISPLAY "ADD    ADD ALBUM RECORD."
        DISPLAY "VIEW   VIEW A INFORMATION ABOUT AN ALBUM RECORD."
        DISPLAY "EDIT   EDIT AN ALBUM RECORD."
        DISPLAY "MORE   MORE OPTIONS."
        DISPLAY "EXIT   EXIT THE APPLICATION."
        PERFORM LINE-SPLIT
    END-PERFORM

    STOP RUN.

LINE-SPLIT.
    DISPLAY "====================================================".
