IDENTIFICATION DIVISION.
PROGRAM-ID. EDIT-BRANCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9.99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.
    01 EDIT-MODE PICTURE X.
        88 EDIT-TITLE VALUE 'T'.
        88 EDIT-ARTIST VALUE 'A'.
        88 EDIT-RATING VALUE 'R'.

PROCEDURE DIVISION.
EDIT-BRANCH.
    DISPLAY "INPUT A TITLE."
    ACCEPT ALBUM-TITLE

    OPEN I-O ALBUM-LIST-FILE

    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "ERROR: FILE 'album-list.txt' DOES NOT EXIST."
        DISPLAY "PLEASE CREATE THE FILE."
        CLOSE ALBUM-LIST-FILE
        EXIT SECTION
    END-IF

    MOVE 'N' TO EOF

    SET FOUND-RECORD-FALSE TO TRUE

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(ALBUM-TITLE-RECORD) EQUAL 
                    FUNCTION LOWER-CASE(ALBUM-TITLE)
                DISPLAY "FOUND RECORD."
                DISPLAY "ARTIST: " FUNCTION TRIM(ALBUM-ARTIST-RECORD)
                DISPLAY "RATING: " FUNCTION TRIM(ALBUM-RATING-RECORD)

                DISPLAY "INPUT ELEMENT TO CHANGE."
                DISPLAY "TITLE/ARTIST/RATING."
                ACCEPT CHOSEN-ACTION
                MOVE CHOSEN-ACTION(1:1) TO EDIT-MODE

                SET FOUND-RECORD-TRUE TO TRUE

                MOVE 'Y' TO EOF
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        CLOSE ALBUM-LIST-FILE
        DISPLAY "NO RECORD FOUND."
        EXIT SECTION
    END-IF
    
    EVALUATE EDIT-MODE
        WHEN 'T'
            DISPLAY "INPUT NEW TITLE."
            ACCEPT ALBUM-TITLE
            MOVE ALBUM-TITLE TO ALBUM-TITLE-RECORD
        WHEN 'A'
            DISPLAY "INPUT NEW ARTIST."
            ACCEPT ALBUM-ARTIST
            MOVE ALBUM-ARTIST TO ALBUM-ARTIST-RECORD
        WHEN 'R'
            DISPLAY "INPUT NEW RATING."
            ACCEPT ALBUM-RATING
            MOVE ALBUM-RATING TO ALBUM-RATING-RECORD
        WHEN OTHER
            DISPLAY "INVALID CHOICE."
    END-EVALUATE
    
    REWRITE ALBUM-RECORD
    
    CLOSE ALBUM-LIST-FILE
    EXIT SECTION.
