>>SOURCE FORMAT FREE
*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. MORE-BRANCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.
    SELECT TRACK-LIST-FILE ASSIGN TO "track-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE-TRACK.
    SELECT ALBUM-LIST-FILE-SORT ASSIGN TO ALBUM-LIST-FILE-SORT-FILE.
    SELECT TRACK-LIST-FILE-SORT ASSIGN TO TRACK-LIST-FILE-SORT-FILE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".
    FD TRACK-LIST-FILE.
        01 TRACK-RECORD.
            03 TRACK-NUMBER-RECORD PICTURE 99.
            03 TRACK-TITLE-RECORD PICTURE X(50).
            03 TRACK-ALBUM-RECORD PICTURE X(50).
            03 TRACK-RECORD-NEWLINE PICTURE X VALUE X"0A".
    SD ALBUM-LIST-FILE-SORT.
        01 ALBUM-RECORD-SORT.
            03 ALBUM-TITLE-RECORD-SORT PICTURE X(50).
            03 ALBUM-ARTIST-RECORD-SORT PICTURE X(50).
            03 ALBUM-RATING-RECORD-SORT PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE-SORT PICTURE X VALUE X"0A".
    SD TRACK-LIST-FILE-SORT.
        01 TRACK-RECORD-SORT.
            03 TRACK-NUMBER-RECORD-SORT PICTURE 99.
            03 TRACK-TITLE-RECORD-SORT PICTURE X(50).
            03 TRACK-ALBUM-RECORD-SORT PICTURE X(50).
            03 TRACK-RECORD-NEWLINE-SORT PICTURE X VALUE X"0A".
    

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9V99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 FILE-STATUS-CODE-TRACK PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 TOTAL-RATING PICTURE 99999V99.
    01 RATING-COUNT PICTURE 9999.
    01 ALBUM-COUNT PICTURE 9999.
    01 MEAN-RATING PICTURE 9.99.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.
    01 STRING-LENGTH PICTURE 99.
    01 LINE-OUTPUT PICTURE X(51).
    01 PAD-INDEX PICTURE 99.

PROCEDURE DIVISION.
MORE-BRANCH.
    DISPLAY "CHOOSE FROM THE FOLLOWING EXTENDED OPTIONS."
    DISPLAY "EMPTY  REMOVE ALL RECORDS."
    DISPLAY "INIT   INITIALIZE STORAGE FILE."
    DISPLAY "CUT    REMOVE A RECORD."
    DISPLAY "SORT   SORT FILES FOR PROPER DISPLAY OF TRACKS."
    DISPLAY "STATS  VIEW STATISTICS FOR ALL ALBUMS."
    DISPLAY "EXIT   EXIT MORE MENU."

    PERFORM LINE-SPLIT

    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    MOVE FUNCTION UPPER-CASE(CHOSEN-ACTION) TO CHOSEN-ACTION

    EVALUATE CHOSEN-ACTION
        WHEN "EMPT"
            PERFORM EMPT-BRANCH
        WHEN "INIT"
            PERFORM INIT-BRANCH
        WHEN "CUT"
            PERFORM CUT-BRANCH
        WHEN "SORT"
            PERFORM SORT-BRANCH
        WHEN "STAT"
            PERFORM STAT-BRANCH
        WHEN "EXIT"
            DISPLAY "MORE CANCELED."
            PERFORM LINE-SPLIT
        WHEN OTHER
            DISPLAY "INVALID OPTION."
            PERFORM LINE-SPLIT
    END-EVALUATE
    
    EXIT SECTION.

INIT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE NOT EQUAL "35"
        DISPLAY "FILE ALREADY EXISTS."
        PERFORM LINE-SPLIT
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
        DISPLAY "SUCCESS FOR ALBUM FILE."
        PERFORM LINE-SPLIT
    END-IF

    OPEN INPUT TRACK-LIST-FILE
    IF FILE-STATUS-CODE-TRACK NOT EQUAL "35"
        DISPLAY "FILE ALREADY EXISTS."
        PERFORM LINE-SPLIT
        CLOSE TRACK-LIST-FILE
    ELSE
        CLOSE TRACK-LIST-FILE
        OPEN OUTPUT TRACK-LIST-FILE
        CLOSE TRACK-LIST-FILE
        DISPLAY "SUCCESS FOR TRACK FILE."
        PERFORM LINE-SPLIT
    END-IF.

EMPT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "FILE DOES NOT EXIST."
        PERFORM LINE-SPLIT
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
        DISPLAY "SUCCESS."
        PERFORM LINE-SPLIT
    END-IF.

CUT-BRANCH.
    DISPLAY "INPUT TITLE."
    PERFORM LINE-SPLIT
    ACCEPT ALBUM-TITLE

    PERFORM LINE-SPLIT
    
    SET FOUND-RECORD-FALSE TO TRUE
    MOVE 'N' TO EOF

    OPEN I-O ALBUM-LIST-FILE
    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF ALBUM-TITLE-RECORD EQUAL ALBUM-TITLE
                MOVE 'Y' TO EOF
                SET FOUND-RECORD-TRUE TO TRUE
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        DISPLAY "RECORD NOT FOUND."
        PERFORM LINE-SPLIT
        CLOSE ALBUM-LIST-FILE
        EXIT PARAGRAPH
    END-IF

    DISPLAY "ARTIST IS THE FOLLOWING."
    DISPLAY FUNCTION TRIM(ALBUM-ARTIST-RECORD) "."
    DISPLAY "IS THAT CORRECT (Y/N)?"
    PERFORM LINE-SPLIT
    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    IF CHOSEN-ACTION EQUAL "Y"
        MOVE " " TO ALBUM-TITLE-RECORD
        MOVE " " TO ALBUM-ARTIST-RECORD
        MOVE 0 TO ALBUM-RATING-RECORD

        REWRITE ALBUM-RECORD

        DISPLAY "SUCCESS."
        PERFORM LINE-SPLIT
    ELSE
        DISPLAY "ABORTED."
        PERFORM LINE-SPLIT
    END-IF

    CLOSE ALBUM-LIST-FILE.

SORT-BRANCH.
    SORT ALBUM-LIST-FILE-SORT
        ON ASCENDING KEY ALBUM-TITLE-RECORD
        USING ALBUM-LIST-FILE
        GIVING ALBUM-LIST-FILE
    SORT TRACK-LIST-FILE-SORT
        ON ASCENDING KEY TRACK-NUMBER-RECORD
        USING TRACK-LIST-FILE
        GIVING TRACK-LIST-FILE
    SORT TRACK-LIST-FILE-SORT
        ON ASCENDING KEY TRACK-ALBUM-RECORD
        USING TRACK-LIST-FILE
        GIVING TRACK-LIST-FILE
        
    DISPLAY "SUCCESS."
    PERFORM LINE-SPLIT.

STAT-BRANCH.
    MOVE 0 TO TOTAL-RATING
    MOVE 0 TO RATING-COUNT
    MOVE 0 TO ALBUM-COUNT
    MOVE 0 TO ALBUM-RATING

    SET EOF-NOT-REACHED TO TRUE

    OPEN INPUT ALBUM-LIST-FILE

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END SET EOF-REACHED TO TRUE
            NOT AT END IF ALBUM-TITLE-RECORD NOT EQUAL " "
                ADD 1 TO ALBUM-COUNT
                IF ALBUM-RATING-RECORD NOT EQUAL 0
                    ADD ALBUM-RATING-RECORD TO TOTAL-RATING
                    ADD 1 TO RATING-COUNT
                    IF ALBUM-RATING-RECORD IS GREATER THAN ALBUM-RATING
                        MOVE ALBUM-RATING-RECORD TO ALBUM-RATING
                        MOVE ALBUM-TITLE-RECORD TO ALBUM-TITLE
                        MOVE ALBUM-ARTIST-RECORD TO ALBUM-ARTIST
                    END-IF
                END-IF
    END-PERFORM

    DISPLAY "TOTAL RECORD COUNT (INCLUDING UNRATED)."
    DISPLAY FUNCTION TRIM(ALBUM-COUNT) "."
    PERFORM LINE-SPLIT

    IF RATING-COUNT EQUAL ZERO
        DISPLAY "NO RATED RECORDS."
        PERFORM LINE-SPLIT
        EXIT PARAGRAPH
    END-IF
    
    DIVIDE TOTAL-RATING BY RATING-COUNT GIVING MEAN-RATING
    DISPLAY "MEAN RATING OVER ALL " RATING-COUNT " RATED ALBUMS."
    DISPLAY MEAN-RATING "."
    PERFORM LINE-SPLIT

    DISPLAY "HIGHEST RATED RECORD."
    DISPLAY "+--------------------------------------------------+"

    MOVE LENGTH OF FUNCTION TRIM(ALBUM-TITLE) TO 
            STRING-LENGTH
    COMPUTE STRING-LENGTH = (50 - STRING-LENGTH) / 2
    MOVE SPACES TO LINE-OUTPUT
    MOVE 1 TO PAD-INDEX
    MOVE "|" TO LINE-OUTPUT (PAD-INDEX:1)
    ADD STRING-LENGTH TO PAD-INDEX
    MOVE LENGTH OF FUNCTION TRIM(ALBUM-TITLE) TO 
            STRING-LENGTH
    MOVE FUNCTION TRIM(ALBUM-TITLE) TO LINE-OUTPUT
            (PAD-INDEX:STRING-LENGTH)
    DISPLAY LINE-OUTPUT "|"

    MOVE LENGTH OF FUNCTION TRIM(ALBUM-ARTIST) TO 
            STRING-LENGTH
    COMPUTE STRING-LENGTH = (50 - STRING-LENGTH) / 2
    MOVE SPACES TO LINE-OUTPUT
    MOVE 1 TO PAD-INDEX
    MOVE "|" TO LINE-OUTPUT (PAD-INDEX:1)
    ADD STRING-LENGTH TO PAD-INDEX
    MOVE LENGTH OF FUNCTION TRIM(ALBUM-ARTIST) TO 
            STRING-LENGTH
    MOVE FUNCTION TRIM(ALBUM-ARTIST) TO LINE-OUTPUT
            (PAD-INDEX:STRING-LENGTH)
    DISPLAY LINE-OUTPUT "|"

    DISPLAY "|                       " ALBUM-RATING "                       |"
    DISPLAY "+--------------------------------------------------+"
    PERFORM LINE-SPLIT
    
    CLOSE ALBUM-LIST-FILE.

LINE-SPLIT.
    DISPLAY "====================================================".
