*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. MORE-BRANCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9.99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 TOTAL-RATING PICTURE 999V99.
    01 RATING-COUNT PICTURE 999.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.

PROCEDURE DIVISION.
MORE-BRANCH.
    DISPLAY "CHOOSE FROM THE FOLLOWING EXTENDED OPTIONS."
    DISPLAY "EMPTY  REMOVE ALL RECORDS."
    DISPLAY "INIT   INITIALIZE STORAGE FILE."
    DISPLAY "CUT    REMOVE A RECORD."

    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    EVALUATE CHOSEN-ACTION
        WHEN "EMPT"
            PERFORM EMPT-BRANCH
        WHEN "INIT"
            PERFORM INIT-BRANCH
        WHEN "CUT"
            PERFORM CUT-BRANCH
        WHEN OTHER
            DISPLAY "INVALID OPTION."
    END-EVALUATE
    
    EXIT SECTION.

INIT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE NOT EQUAL "35"
        DISPLAY "FILE ALREADY EXISTS."
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
        DISPLAY "SUCCESS."
    END-IF.

EMPT-BRANCH.
    OPEN INPUT ALBUM-LIST-FILE
    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "FILE DOES NOT EXIST."
        CLOSE ALBUM-LIST-FILE
    ELSE
        CLOSE ALBUM-LIST-FILE
        OPEN OUTPUT ALBUM-LIST-FILE
        CLOSE ALBUM-LIST-FILE
        DISPLAY "SUCCESS."
    END-IF.

CUT-BRANCH.
    DISPLAY "INPUT TITLE."
    ACCEPT ALBUM-TITLE

    PERFORM LINE-SPLIT
    
    SET FOUND-RECORD-FALSE TO TRUE
    MOVE 'N' TO EOF

    OPEN I-O ALBUM-LIST-FILE
    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF ALBUM-TITLE-RECORD EQUAL ALBUM-TITLE
                MOVE 'Y' TO EOF
                SET FOUND-RECORD-TRUE TO TRUE
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        DISPLAY "RECORD NOT FOUND."
        CLOSE ALBUM-LIST-FILE
        EXIT PARAGRAPH
    END-IF

    DISPLAY "ARTIST IS " FUNCTION TRIM(ALBUM-ARTIST-RECORD) "."
    DISPLAY "IS THAT CORRECT (Y/N)?"
    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    IF CHOSEN-ACTION EQUAL "Y"
        MOVE " " TO ALBUM-TITLE-RECORD
        MOVE " " TO ALBUM-ARTIST-RECORD
        MOVE 0 TO ALBUM-RATING-RECORD

        REWRITE ALBUM-RECORD

        DISPLAY "SUCCESS."
    ELSE
        DISPLAY "ABORTED."
    END-IF

    CLOSE ALBUM-LIST-FILE.

LINE-SPLIT.
    DISPLAY "====================================================".
