>>SOURCE FORMAT FREE
*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. TRAC-BRANCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TRACK-LIST-FILE ASSIGN TO "track-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD TRACK-LIST-FILE.
        01 TRACK-RECORD.
            03 TRACK-NUMBER-RECORD PICTURE 99.
            03 TRACK-TITLE-RECORD PICTURE X(50).
            03 TRACK-ALBUM-RECORD PICTURE X(50).
            *> 03 TRACK-RATING-RECORD PICTURE 9V99.
            03 TRACK-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 TRACK-NUMBER PICTURE 99.
    01 TRACK-TITLE PICTURE X(50).
    01 TRACK-ALBUM PICTURE X(50).
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.

PROCEDURE DIVISION.
TRAC-BRANCH.
    DISPLAY "CHOOSE AN ACTION."
    DISPLAY "ADD        ADD A TRACK."
    DISPLAY "CUT        CUT A TRACK."
    DISPLAY "LIST       LIST TRACKS OF ALBUM."

    PERFORM LINE-SPLIT

    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    EVALUATE CHOSEN-ACTION
        WHEN "ADD"
            PERFORM TRAC-ADD
        WHEN "CUT"
            PERFORM TRAC-CUT
        WHEN "LIST"
            PERFORM TRAC-LIST
        WHEN OTHER
            DISPLAY "MODE NOT RECOGNIZED."
            PERFORM LINE-SPLIT
    END-EVALUATE
    EXIT SECTION.

TRAC-ADD.
    DISPLAY "ADD TRACK RECORD FUNCTION."
    PERFORM LINE-SPLIT
    DISPLAY "INPUT A TITLE."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-TITLE
    PERFORM LINE-SPLIT
    DISPLAY "INPUT AN ALBUM."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-ALBUM
    PERFORM LINE-SPLIT
    DISPLAY "INPUT A TRACK NUMBER."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-NUMBER

    PERFORM LINE-SPLIT

    OPEN INPUT TRACK-LIST-FILE

    IF FILE-STATUS-CODE EQUAL "35"
        DISPLAY "ERROR: FILE 'track-list.txt' DOES NOT EXIST."
        DISPLAY "PLEASE CREATE THE FILE."
        PERFORM LINE-SPLIT
        CLOSE TRACK-LIST-FILE
        EXIT SECTION
    ELSE
        IF FILE-STATUS-CODE NOT EQUAL "00"
            DISPLAY "FILE FAILED WITH STATUS: " FILE-STATUS-CODE
            PERFORM LINE-SPLIT
            CLOSE TRACK-LIST-FILE
            EXIT SECTION
        END-IF
    END-IF

    MOVE 'N' TO EOF
    PERFORM UNTIL EOF-REACHED
        READ TRACK-LIST-FILE
            AT END SET EOF-REACHED TO TRUE
            NOT AT END IF TRACK-TITLE-RECORD EQUAL TRACK-TITLE AND 
                    TRACK-ALBUM-RECORD EQUAL TRACK-ALBUM
                DISPLAY "RECORD ALREADY EXISTS."
                PERFORM LINE-SPLIT
                CLOSE TRACK-LIST-FILE
                EXIT PARAGRAPH
            END-IF
    END-PERFORM

    CLOSE TRACK-LIST-FILE

    OPEN I-O TRACK-LIST-FILE

    MOVE 'N' TO EOF
    PERFORM UNTIL EOF-REACHED
        READ TRACK-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF TRACK-TITLE-RECORD EQUAL " "
                MOVE TRACK-TITLE TO TRACK-TITLE-RECORD
                MOVE TRACK-ALBUM TO TRACK-ALBUM-RECORD
                MOVE TRACK-NUMBER TO TRACK-NUMBER-RECORD
                REWRITE TRACK-RECORD
                CLOSE TRACK-LIST-FILE
                DISPLAY "SUCCESS."
                PERFORM LINE-SPLIT
                EXIT PARAGRAPH
            END-IF
    END-PERFORM

    CLOSE TRACK-LIST-FILE

    INITIALIZE TRACK-RECORD
    MOVE TRACK-TITLE TO TRACK-TITLE-RECORD
    MOVE TRACK-ALBUM TO TRACK-ALBUM-RECORD
    MOVE TRACK-NUMBER TO TRACK-NUMBER-RECORD
    MOVE X"0A" TO TRACK-RECORD-NEWLINE

    OPEN EXTEND TRACK-LIST-FILE

    WRITE TRACK-RECORD

    DISPLAY "SUCCESS."
    PERFORM LINE-SPLIT

    CLOSE TRACK-LIST-FILE.

TRAC-CUT.
    DISPLAY "INPUT TITLE."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-TITLE
    PERFORM LINE-SPLIT

    DISPLAY "INPUT ALBUM."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-ALBUM
    PERFORM LINE-SPLIT
    
    SET FOUND-RECORD-FALSE TO TRUE
    MOVE 'N' TO EOF

    OPEN I-O TRACK-LIST-FILE

    PERFORM UNTIL EOF-REACHED
        READ TRACK-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF TRACK-TITLE-RECORD EQUAL TRACK-TITLE AND 
                    TRACK-ALBUM-RECORD EQUAL TRACK-ALBUM
                MOVE 'Y' TO EOF
                SET FOUND-RECORD-TRUE TO TRUE
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        DISPLAY "RECORD NOT FOUND."
        PERFORM LINE-SPLIT
        CLOSE TRACK-LIST-FILE
        EXIT PARAGRAPH
    END-IF

    DISPLAY "THE TRACK IS THE FOLLOWING." 
    DISPLAY FUNCTION TRIM(TRACK-TITLE-RECORD) "."
    DISPLAY "IS THAT CORRECT (Y/N)?"
    PERFORM LINE-SPLIT
    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    IF CHOSEN-ACTION EQUAL "Y"
        MOVE " " TO TRACK-TITLE-RECORD
        MOVE " " TO TRACK-ALBUM-RECORD
        MOVE 0 TO TRACK-NUMBER-RECORD

        REWRITE TRACK-RECORD

        DISPLAY "SUCCESS."
        PERFORM LINE-SPLIT
    ELSE
        DISPLAY "ABORTED."
        PERFORM LINE-SPLIT
    END-IF

    CLOSE TRACK-LIST-FILE.

TRAC-LIST.
    DISPLAY "INPUT AN ALBUM TITLE."
    PERFORM LINE-SPLIT
    ACCEPT TRACK-ALBUM
    PERFORM LINE-SPLIT

    OPEN INPUT TRACK-LIST-FILE

    MOVE 'N' TO EOF

    SET FOUND-RECORD-FALSE TO TRUE

    DISPLAY "+--------------------------------------------------+"

    PERFORM UNTIL EOF-REACHED
        READ TRACK-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(TRACK-ALBUM-RECORD) EQUAL
                    FUNCTION LOWER-CASE(TRACK-ALBUM)
                DISPLAY "|" TRACK-TITLE-RECORD "|"
                DISPLAY "+--------------------------------------------------+"
                SET FOUND-RECORD TO "Y"
            END-IF
    END-PERFORM

    PERFORM LINE-SPLIT

    IF FOUND-RECORD-FALSE
        DISPLAY "NO RECORD FROM THAT ALBUM FOUND."
        PERFORM LINE-SPLIT
    END-IF
    CLOSE TRACK-LIST-FILE.

LINE-SPLIT.
    DISPLAY "====================================================".
