*> Copyright (C) 2025 D. Hargitt
*> This program has been made available under the GNU General Public License.
*> It is distributed WITHOUT ANY WARRANTY. See LICENSE.md for details.

IDENTIFICATION DIVISION.
PROGRAM-ID. VIEW-BRANCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ALBUM-LIST-FILE ASSIGN TO "album-list.txt"
        ORGANIZATION IS SEQUENTIAL
        FILE STATUS IS FILE-STATUS-CODE.

DATA DIVISION.
FILE SECTION.
    FD ALBUM-LIST-FILE.
        01 ALBUM-RECORD.
            03 ALBUM-TITLE-RECORD PICTURE X(50).
            03 ALBUM-ARTIST-RECORD PICTURE X(50).
            03 ALBUM-RATING-RECORD PICTURE 9V99.
            03 ALBUM-RECORD-NEWLINE PICTURE X VALUE X"0A".

WORKING-STORAGE SECTION.
    01 CHOSEN-ACTION PICTURE X(4).
    01 ALBUM-TITLE PICTURE X(50).
    01 ALBUM-ARTIST PICTURE X(50).
    01 ALBUM-RATING PICTURE 9V99.
    01 FILE-STATUS-CODE PICTURE XX.
    01 EOF PICTURE X.
        88 EOF-REACHED VALUE 'Y'.
        88 EOF-NOT-REACHED VALUE 'N'.
    01 TOTAL-RATING PICTURE 9999V9999.
    01 RATING-COUNT PICTURE 999.
    01 FOUND-RECORD PICTURE X.
        88 FOUND-RECORD-TRUE VALUE 'Y'.
        88 FOUND-RECORD-FALSE VALUE 'N'.

PROCEDURE DIVISION.
VIEW-BRANCH.
    DISPLAY "CHOOSE A VIEWING MODE."
    DISPLAY "ALBUM      INDIVIDUAL ALBUM."
    DISPLAY "ARTIST     INDIVIDUAL ARTIST."
    DISPLAY "LIST       LIST OF ALL ALBUMS."

    PERFORM LINE-SPLIT

    ACCEPT CHOSEN-ACTION

    PERFORM LINE-SPLIT

    EVALUATE CHOSEN-ACTION
        WHEN "ALBU"
            PERFORM VIEW-INDIVIDUAL-ALBUM
        WHEN "ARTI"
            PERFORM VIEW-ARTIST
        WHEN "LIST"
            PERFORM VIEW-LIST
        WHEN "OTHER"
            DISPLAY "MODE NOT RECOGNIZED."
    END-EVALUATE
    EXIT SECTION.

VIEW-INDIVIDUAL-ALBUM.
    DISPLAY "INPUT A TITLE."

    PERFORM LINE-SPLIT

    ACCEPT ALBUM-TITLE

    PERFORM LINE-SPLIT

    OPEN INPUT ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    SET FOUND-RECORD-FALSE TO TRUE

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(ALBUM-TITLE-RECORD) EQUAL
                    FUNCTION LOWER-CASE(ALBUM-TITLE)
                DISPLAY "FOUND RECORD."
                DISPLAY "ARTIST: " FUNCTION TRIM(ALBUM-ARTIST-RECORD)
                DISPLAY "RATING: " FUNCTION TRIM(ALBUM-RATING-RECORD)
                PERFORM LINE-SPLIT
                SET FOUND-RECORD TO "Y"
            END-IF
    END-PERFORM

    IF FOUND-RECORD-FALSE
        DISPLAY "NO RECORD WITH THAT TITLE FOUND."
        PERFORM LINE-SPLIT
    END-IF
    CLOSE ALBUM-LIST-FILE.

VIEW-ARTIST.
    OPEN INPUT ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    MOVE 0 TO TOTAL-RATING
    MOVE 0 TO RATING-COUNT

    DISPLAY "INPUT ARTIST NAME."

    PERFORM LINE-SPLIT

    ACCEPT ALBUM-ARTIST

    PERFORM LINE-SPLIT

    DISPLAY "LIST OF ALBUMS."
    DISPLAY "+--------------------------------------------------+"

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(ALBUM-ARTIST-RECORD) EQUAL 
                    FUNCTION LOWER-CASE(ALBUM-ARTIST)
                DISPLAY "|" ALBUM-TITLE-RECORD "|"
                DISPLAY "+--------------------------------------------------+"
                IF ALBUM-RATING-RECORD NOT EQUAL 0
                    ADD ALBUM-RATING-RECORD TO TOTAL-RATING
                    ADD 1 TO RATING-COUNT
                END-IF
            END-IF
    END-PERFORM
    PERFORM LINE-SPLIT

    CLOSE ALBUM-LIST-FILE

    IF RATING-COUNT EQUAL 0
        DISPLAY "ARTIST HAS NO RATED RECORDS."
        PERFORM LINE-SPLIT
        EXIT PARAGRAPH
    END-IF

    DIVIDE TOTAL-RATING BY RATING-COUNT GIVING ALBUM-RATING
    DISPLAY "AVERAGE RATING OUT OF " RATING-COUNT " RECORDS."
    DISPLAY ALBUM-RATING "."
    PERFORM LINE-SPLIT

    OPEN INPUT ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    MOVE 0 TO TOTAL-RATING *> ACTING AS SUM OF SQUARED DEVIATIONS

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF FUNCTION LOWER-CASE(ALBUM-ARTIST-RECORD) EQUAL 
                    FUNCTION LOWER-CASE(ALBUM-ARTIST)
                IF ALBUM-RATING-RECORD NOT EQUAL 0
                    COMPUTE TOTAL-RATING = TOTAL-RATING + ((ALBUM-RATING-RECORD
                            - ALBUM-RATING) * (ALBUM-RATING-RECORD - 
                            ALBUM-RATING))
                END-IF
            END-IF
    END-PERFORM.

    DIVIDE TOTAL-RATING BY RATING-COUNT GIVING TOTAL-RATING
    MOVE FUNCTION SQRT(TOTAL-RATING) TO ALBUM-RATING
    IF RATING-COUNT IS GREATER THAN 1
        DISPLAY "STANDARD DEVIATION."
        DISPLAY ALBUM-RATING "."
        PERFORM LINE-SPLIT
    END-IF

    CLOSE ALBUM-LIST-FILE.

VIEW-LIST.
    OPEN INPUT ALBUM-LIST-FILE

    MOVE 'N' TO EOF

    DISPLAY "+--------------------------------------------------+"

    PERFORM UNTIL EOF-REACHED
        READ ALBUM-LIST-FILE
            AT END MOVE 'Y' TO EOF
            NOT AT END IF ALBUM-TITLE-RECORD NOT EQUAL " "
                DISPLAY "|" ALBUM-TITLE-RECORD "|"
                DISPLAY "|" ALBUM-ARTIST-RECORD "|"
                DISPLAY "+--------------------------------------------------+"
            END-IF
    END-PERFORM
    PERFORM LINE-SPLIT
    CLOSE ALBUM-LIST-FILE.

LINE-SPLIT.
    DISPLAY "====================================================".
